Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memf.tmx
Source language: ca
Languages: es_es

source: Quan la imatge és la d'un text imprés, un programa de reconeixement òptic de caràcters (OCR, optical character recognition) la pot convertir en una representació del text adequada per a ser manipulada amb un processador de textos (vegeu la secció ), generalment amb alguns errors tipogràfics menors.
es_es: Cuando la imagen es la de un texto impreso, un programa de reconocimiento óptico de caracteres (OCR, optical character recognition) la puede convertir en una representación del texto adecuada para ser manipulada con un procesador de textos (ver la sección ), generalmente con algunos errores tipográficos menores.

source: Ara es consideren el programari i el maquinari amb més detall.
es_es: Ahora se consideran el software y el hardware con más detalle.

source: En el servidor {http://projectes.lafarga.cat/projects/llibreiat} trobareu els fitxers font (, .eps, etc.) necessaris per a tornar a generar el llibre, de manera que, si ho desitgeu, els podeu modificar per a generar un text nou i publicar-lo vosaltres, però sempre d'acord amb les condicions de la Llicencia General Pública de GNU (descrita en {http://www.gnu.org/licenses/gpl.txt}).
es_es: En el servidor {http://projectes.lafarga.cat/projects/llibreiat} encontraréis los ficheros fuente (, .eps, etc.) necesarios para volver a generar el libro, de forma que, si lo deseáis, los podéis modificar para generar un texto nuevo y publicarlo vosotros, pero siempre de acuerdo con las condiciones de la Licencia General Pública de GNU (descrita en {http://www.gnu.org/licenses/gpl.txt}).

source: En els ordinadors personals, la unitat central és un únic xip de silici.
es_es: En los ordenadores personales, la unidad central es un único chip de silicio.

source: Estats Federats de Micronèsia
es_es: Los Estados Federados de Micronesia

source: [De sobretaula] (en anglés desktop): Estan formats per una caixa amb dispositius de processament i emmagatzematge i un conjunt de perifèrics com ara el teclat, el ratolí o la pantalla.
es_es: [De sobremesa] (en inglés desktop): Están formados por una caja con dispositivos de procesamiento y almacenamiento y un conjunto de elementos periféricos como el teclado, el ratón o la pantalla.

source: En cert sentit, el sistema operatiu és com el factor comú de tots els programes d'aplicació.
es_es: En cierto sentido, el sistema operativo es como el factor común de todos los programas de aplicación.

source: El DVD és la darrera generació de sistemes d'emmagatzematge basat en discs òptics; bàsicament, es tracta d'un CD més ràpid i amb més capacitat.
es_es: El DVD es la última generación de sistemas de almacenamiento basado en discos ópticos; básicamente, se trata de un CD más rápido y con más capacidad.

source: fins a produir un document imprés amb característiques de publicació.
es_es: hasta producir un documento impreso con características de publicación.

source: El nom sol ser normalment lliure, però l'extensió sol ser curta (entre una i quatre lletres) i sol identificar el programa que s'ha d'usar per a processar-lo o el format en què es troben les dades que conté (per exemple, l'extensió .txt identifica normalment un text senzill en format ASCII o ANSI, vegeu l'apartat ; l'extensió .exe s'usa per als programes d'ordinador, etc.).
es_es: El nombre suele ser libre, pero la extensión es normalmente corta (entre una y cuatro letras) y suele identificar el programa que hay que usar para procesarlo o el formato en que se encuentran los datos que contiene (por ejemplo, la extensión .txt identifica normalmente un texto sencillo en formato ASCII o ANSI, mirad el apartado ; la extensión .exe se usa para los programas de ordenador, etc.).

source: Si necessitem guardar objectes o unitats d'informació que tenen més de dos valors possibles, no tindrem prou amb 1 bit; haurem de combinar més d'un bit.
es_es: Si necesitamos guardar objetos o unidades de información que tienen más de dos valores posibles, no tendremos suficiente con 1 bit; tendremos que combinar más de uno.

source: institució educativa
es_es: institución educativa

source: Aquests indicatius apareixen en la taula .
es_es: Estos indicativos aparecen en la tabla .

source: Quina d'aquestes afirmacions es certa?
es_es: \item No, porque un soporte es electrónico y el otro óptico.

source: La primera part és l'identificador de l'usuari i la segona, el nom d'un ordinador (o d'un grup d'ordinadors que comparteixen un nom).
es_es: La primera parte es el identificador del usuario y la segunda, el nombre de un ordenador (o de un grupo de ordenadores que comparten un mismo nombre).

source: Deriva del processador de 16 bits 286 (80286), que al seu torn deriva del 8086, un dels primers processadors instal·lat en els PC.
es_es: Deriva del procesador de 16 bits 286 (80286), que a su vez deriva del 8086, uno de los primeros procesadores instalando en los PC.

source: {Tipus de programari:} Hi ha tres classes bàsiques de programari:
es_es: {Tipo de software:} Hay tres clases básicas de software:

source: És capaç de processar 32 bits per cicle.
es_es: Es capaz de procesar 32 bits por ciclo.

source: Només si està escrit en un llenguatge de programació d'alt nivell, perquè només així serà un text i podrà guardar-se en un fitxer.
es_es: \item Sólo si está escrito en un lenguaje de programación de alto nivel, porque sólo así será un texto y podrá guardarse en un fichero.

source: Quina característica és comuna a tots els tipus de programari?
es_es: \item ¿Qué característica tienen en común todos los tipos de software?

source: Tots els sistemes informàtics es poden dividir en dues parts: maquinari i programari.
es_es: Todos los sistemas informáticos se pueden dividir en dos partes: hardware y software .

source: Cal fer-ho 15 vegades; per tant, necessitem 15 bits.
es_es: por lo tanto, necesitamos 15 bits.

source: Sud-àfrica
es_es: Sudáfrica

source: Aquests ordinadors, llançats al mercat el 1984, popularitzaren la interfície gràfica d'usuari, tota una revolució per a l'època.
es_es: Estos ordenadores, lanzados al mercado en 1984, popularizaron la interfaz gráfica de usuario, toda una revolución para la época.

source: Són massa gent per a esmentar-los tots.
es_es: Son demasiada gente para mencionarlos todos.

source: En la memòria RAM de l'ordinador.
es_es: \item En la memoria RAM del ordenador.

source: La memòria ROM sol estar feta de xips de silici.
es_es: La memoria ROM suele estar hecha de chips de silicio.

source: {} programari (software).
es_es: \item {\ldots} \emph{software}.

source: Introducció
es_es: Introducción

source: [4.] Si el caràcter en la posició $p$ de $A$ no és igual al caràcter en la posició $p$ de $B$, vés a 8.
es_es: [4.] Si el caracter en la posición $p$ de $A$ no es igual al caracter en la posición $p$ de $B$, ve a 8.

source: [8.] Digues no i para.
es_es: [8.] Di no y para.

source: {} tardarà menys a executar els programes.
es_es: \item {\ldots} tardará menos en ejecutar los programas.

source: Hi ha molts tipus d'adaptadors de vídeo.
es_es: Hay muchos tipos de adaptadores de video.

source: Un petit glossari
es_es: Un pequeño glosario

source: (c) (b) (b) (c) (a) (c)
es_es: \item (c) \item (b) \item (b) \item (c) \item (a) \item (c)

source: Que continga instruccions innecesàries però que no destorben el seu funcionament.
es_es: \item Que contenga instrucciones innecesarias pero que no estorben su funcionamiento.

source: Quines són les característiques de la memòria RAM?
es_es: \item ¿Cuáles son las características de la memoria RAM? \begin{enumerate} \item Es lenta, volátil y de acceso aleatorio.

source: Un octet pot contenir, per tant, molt poca informació (un caràcter, una instrucció senzilla del processador central, un nombre de 0 (``{ 00000000}'') a 255 (``{ 11111111}''), etc.).
es_es: Un byte puede contener, por tanto, muy poca información (un caracter, una instrucción sencilla del procesador central, un número de 0 (``{ 00000000}'') a 255 (``{ 11111111}''), etc.).

source: Els enters inicials s'usen per a designar grans subxarxes, mentre que els finals s'usen per a designar xarxes més menudes, i dins d'aquestes, ordinadors concrets (en això recorden els números de telèfon: dos abonats pròxims normalment comparteixen les xifres inicials).
es_es: Los enteros iniciales se usan para designar grandes subredes, mientras que los finales se usan para designar redes más diversas, y dentro de éstas, ordenadores concretos (esto recuerda los números de teléfono: dos personas abonadas que están cerca normalmente comparten las cifras iniciales).

source: Maquinari
es_es: Hardware

source: Memòria
es_es: Memoria

source: Quants valors possibles pot prendre un octet o byte?
es_es: \item ¿Cuántos valores posibles puede tomar un \emph{byte}? \begin{enumerate} \item 2 \item 256 \item 8 \end{enumerate}

source: Així, cada dígit decimal ocupa quatre bits; si n'hi ha 9, necessitem 36 bits.
es_es: Así, cada dígito decimal ocupa cuatro bits;

source: El nombre de bits necessari per a poder generar 32050 combinacions és el nombre de vegades que cal multiplicar \(2 2\) just fins al punt en què se supera 32050.
es_es: El número de bits necesario para poder generar 32050 combinaciones es el número de veces que hay que multiplicar \(2\times 2\times\ldots\) justo hasta el punto en el que se supera 32050.

source: Que consisteixen en una llista d'instruccions executables.
es_es: \item Que consisten en una lista de instrucciones ejecutables.

source: Fixeu-vos que dues carpetes diferents contenen arxius amb el mateix nom ``iat1.txt''; això no és problema si considerem la trajectòria completa com a nom del fitxer.
es_es: Fijaos en que dos carpetas diferentes contienen archivos con el mismo nombre ``iat1.txt''; eso no es ningún problema si consideramos la trayectoria completa como nombre del fichero.

source: [2.] Si el caràcter en la posició $p$ de $A$ no és igual al caràcter en la posició $p$ de $B$, digues no i para.
es_es: [2.] Si el caracter en la posición $p$ de $A$ no es igual al caracter en la posición $p$ de $B$, di no y para.

source: Universitat d'Alacant
es_es: Universidad de Alicante

source: És el successor del 386 ---té un conjunt d'instruccions més complet---, i processa, com aquest, 32 bits per cicle; tots els programes escrits per a ser executats pels processadors 386 poden ser executats pels processadors 486.
es_es: Es el sucesor del 386 ---tiene un conjunto de instrucciones más completo---, y procesa, como éste, 32 bits por ciclo; todos los programas escritos para ser ejecutados por los procesadores 386 pueden ser ejecutados por los procesadores 486.

source: El nom navegador s'usa per l'analogia ---dèbil--- existent entre els mecanismes d'accés als documents de la Internet i la navegació mitjançant un mapa en una zona desconeguda.
es_es: El nombre navegador se usa por la analogía ---débil--- existente entre los mecanismos de acceso a los documentos de Internet y la navegación mediante un mapa en una zona desconocida.

source: Departament de Llenguatges i Sistemes Informàtics
es_es: Departamento de Lenguajes y Sistemas Informáticos

source: (a) (c) (b): $2^8=2 2 2 2 2 2 2 2=256$.
es_es: \item (a) \item (b) \item (a) \item (a):

source: Si els càlculs es fan amb números redons (1.000 en comptes de 1.024, etc.) la resposta més aproximada (375 kB) és la correcta.
es_es: Si los cálculos se hacen con números redondos (1.000 en vez de 1.024, etc.)

source: Si tornem a carregar les bateries i encenem l'ordinador, fan l'operació inversa.
es_es: Si volvemos a cargar las baterías y encendemos el ordenador, hacen la operación inversa.

source: però no necessàriament comprensibles per a un ordinador
es_es: pero no necesariamente comprensibles para un ordenador

source: El sistema operatiu d'un ordinador és{}
es_es: \item El \emph{sistema operativo} de un ordenador es{\ldots}

source: Molts dels servidors d'Internet encarregats de manipular informació privada usen aquest esquema.
es_es: Muchos de los servidores de Internet encargados de manipular información privada usan este esquema.

source: Per exemple, una adreça electrònica vàlida podria ser { Monica.Lewinsky@whitehouse.gov} De vegades, una adreça electrònica identifica una llista d'usuaris (àlies) o una llista de distribució (la qual envia una còpia de cada missatge que rep a tots els inscrits en la llista).
es_es: Por ejemplo, una dirección electrónica válida podría ser { Monica.lewinsky@whitehouse.gov} A veces, una dirección electrónica identifica una lista de usuarios (alias) o una lista de distribución (la cual envía una copia de cada mensaje que recibe a todos los inscritos en la lista).

source: en el CD-ROM en el disc fix en la memòria RAM
es_es: \begin{enumerate} \item en el CD-ROM \item en el disco fijo \item en la memoria RAM \end{enumerate}

source: notes de classe amb exercicis i problemes resolts
es_es: notas de clase con ejercicios y problemas resueltos

source: Itàlia
es_es: Italia

source: Un processador A pot executar tots els programes escrits per a un altre processador B només si{}
es_es: \item Un procesador \begin{math}A\end{math} puede ejecutar todos los programas escritos para otro procesador \begin{math}B\end{math} sólo si{\ldots}

source: Els mòdems telefònics modulen (converteixen senyals digitals a analògics) i desmodulen (converteixen senyals analògics en digitals) per a enviar i rebre dades per la línia telefònica.
es_es: Los módems telefónicos modulan (convierten señales digitales a analógicos) y desmodulan (convierten señales analógicas en digitales) para enviar y recibir datos por la línea telefónica.

source: [Portàtils] (en anglés laptop i de vegades notebook): Tenen una grandària menor que la d'un maletí i un pes lleuger que permet dur-los sense massa esforç d'un lloc a un altre.
es_es: [Portátiles] (en inglés laptop y a veces notebook): Tienen un tamaño menor que la de un maletín y un peso ligero que permiten llevarlos sin mucho esfuerzo de un sitio a otro.

source: Per exemple, la llista de distribució sobre traducció automàtica MT-List, mantiguda per l'EAMT (European Association for Machine Translation, associació europea per a la traducció automàtica), té l'adreça mt-list@eamt.org; per a formar part de la llista cal subscriure's en l'URI {http://www.pairlist.net/mailman/listinfo/mt-list
es_es: Por ejemplo, la lista de distribución sobre traducción automática MT-List, mantenida por la EAMT (European Association for Machine Translation, Asociación Europea para la Traducción Automática), tiene la dirección mt-list@eamt.org; para formar parte de la lista hay que subscribirse en el URI {http://www.pairlist.net/mailman/listinfo/mt-list

source: Per exemple, un document de text com aquest té desenes de milers de caràcters, i una enciclopèdia, centenars de milions.
es_es: Por ejemplo, un documento de texto como éste tiene decenas de miles de caracteres, y una enciclopedia, centenares de miles.

source: Com que cada octet son 8 bits, són necessaris 2 octets.
es_es: Como cada byte son 8 bits, son necesarios 2 bytes.

source: Quina d'aquestes definicions de fitxer és més correcta?
es_es: \end{enumerate} \item ¿Cuál de estas afirmaciones es cierta?

source: Messenger, i AIM (America Online Instant Messneger); entre els no comercials podem esmentar jabber ({jabber.org}).
es_es: Messenger y AIM (America Online Instant Messenger); entre los no comerciales podemos mencionar jabber ({jabber.org}).

source: [5.] Suma 1 a $p$.
es_es: [4.] Suma 1 a p. [5.] Ve al paso 2.

source: Unes 100.
es_es: \item Unas 100.

source: Si les imatges enviades per un telèfon mòbil sense colors (blanc i negre) tenen 100$$100 píxels, quantes d'aquestes imatges podriem emmagatzemar en un disquet de densitat alta?
es_es: \end{enumerate} \item Si las imágenes enviadas por un teléfono móvil sin colores (blanco y negro) tienen 100$\times$100 píxeles, ¿cuántas de estas imágenes podriamos almacenar en un disquete de alta densidad?

source: (c) (c) (c) (c) (b) (c) (b).
es_es: \item (c) \item (c) \item (c) \item (c) \item (b) \item (c) \item (b).

source: {} executarà els programes a la mateixa velocitat.
es_es: \begin{enumerate} \item {\ldots} ejecutará los programas a la misma velocidad.

source: } Si es pot suposar que a les cadenes de caràcters s'afegeix un símbol especial de final de cadena (per exemple, `\$'), l'algorisme se simplifica:
es_es: } Si se puede suponer que a las cadenas de caracteres se añade un símbolo especial de final de cadena (por ejemplo, `\$'), el algoritmo se simplifica:

source: Altres noms que s'usen (més recentment) en comptes d'Internet són World Wide Web o WWW (``teranyina d'abast mundial'') o simplement web (``teranyina''), masculí en català (el web).
es_es: Otros nombres que se usan (más recientemente) en vez de Internet son World Wide Web o más conocido comoWWW ("telaraña de alcance mundial'') o simplemente web ("telaraña'').

source: Després de l'esquema d'accés, un URI (identificador uniforme de recursos) especifica la velocitat de transferència.
es_es: Después del esquema de acceso, un URI (identificador uniforme de recursos) especifica la velocidad de transferencia.

source: Els identificadors
es_es: Los grupos de noticias tienen nombres compuestos por varias palabras separadas por puntos, como por ejemplo { comp.ai.neural-nets}.

source: [1.] Fes que $p$ valga 1.
es_es: [1.] Haz que $p$ valga 1.

source: Quants bits necessitem per codificar un número de telèfon de 9 xifres suposant que codifiquem els dígits un a un?
es_es: \item ¿Cuántos bits necesitamos para codificar un número de teléfono de 9 cifras suponiendo que codificamos los dígitos uno a uno?

source: {} estalviar espai quan es guarden els fitxers.
es_es: \item {\ldots} ahorrar espacio cuando se guardan los ficheros.

source: Quan el processador central executa un programa, on espera trobar la següent instrucció?
es_es: \item Cuando el procesador central ejecuta un programa, ¿dónde espera encontrar la siguiente instrucción?

source: {} el conjunt d'instruccions del processador A conté totes les instruccions del processador B.
es_es: \item {\ldots} el conjunto de instrucciones del procesador \begin{math}A\end{math} contiene todas las instrucciones del procesador \begin{math}B\end{math}.

source: Una velocitat més gran implica una velocitat d'execució més gran, sempre que no hi haja altres circumstàncies limitants (per exemple, una falta de memòria).
es_es: Una velocidad mayor implica una velocidad de ejecución más grande, siempre que no haya otras circunstancias limitantes (por ejemplo, falta de memoria).

source: És possible que un fitxer de text i la carpeta en què està inclòs tinguen el mateix nom?
es_es: \item ¿Es posible que un fichero de texto y la carpeta en la que está incluido tengan el mismo nombre?

source: {} el conjunt d'instruccions del processador B conté totes les instruccions del processador A.
es_es: \item {\ldots} el conjunto de instrucciones del procesador \begin{math}A\end{math} contiene todas las instrucciones del procesador \begin{math}B\end{math}.

source: Sí, si estan connectats formant una xarxa.
es_es: \begin{enumerate} \item Sí, si están conectados formando una red.

source: [gigahertz:] un gigahertz són 1000 megahertz (vegeu megahertz en aquest glossari).
es_es: [gigaherzio:] un gigaherzio son 1000 megaherzios (ver megaherzio en este glosario).

source: El xip és l'element bàsic de la microelectrònica i de la microinformàtica; es tracta d'un o més circuits integrats en una placa de silici de dimensions molt reduïdes, que normalment es col·loca en una capsa hermètica amb contactes metàl·lics.
es_es: El chip es el elemento básico de la microelectrónica y de la microinformática; se trata de uno o más circuitos integrados en una placa de silicio de dimensiones muy reducidas, que normalmente se coloca en una caja hermética con contactos metálicos.

source: [adaptador de vídeo] (també anomenada targeta gràfica o controlador de vídeo): Targeta que permet connectar un monitor a l'ordinador.
es_es: [adaptador de video] (también llamado tarjeta gráfica o controlador de video): Tarjeta que permite conectar un monitor al ordenador.

source: El seu llibre, Kitab al-jabr wa al-muqabalah, o { Llibre de la integració i l'equació}, va donar nom també a l'àlgebra quan es va traduir al llatí en el segle XII.
es_es: Su libro, Kitab al-jabr wa al-muqabalah, o { Libro de la integración y la ecucación}, dio también nombre al álgebra cuando se tradujo al latín en el siglo XII.

source: Els DVD són una classe de disc òptic més veloç i amb més capacitat que els CD-ROM
es_es: Los DVDs son una clase de disco óptico más veloz y con más capacidad que los CD-ROM

source: Fins fa poc, els proveïdors d'Internet solien oferir normalment una tarifa fixa (una certa quantitat al mes, independentment del temps de connexió), però el cost de la telefonada local necessària es pagava sempre per minuts.
es_es: Hasta hace poco, los proveedores de Internet solían ofrecer normalmente una tarifa fija (una cierta cantidad al mes, independientemente del tiempo de conexión), pero el coste de la llamada local necesaria se pagaba siempre por minutos.

source: Per exemple, un programa que suma tots els nombres enters del 1 al 10 podria ser el següent, el qual usa dues posicions de memòria RAM per a guardar valors necessaris per al càlcul.
es_es: Por ejemplo, un programa que suma todos los números enteros del 1 al 10 podría ser el siguiente, el cual usa dos posiciones de memoria RAM para guardar valores necesarios para el cálculo.

source: De fet, per fidelitat al sistema binari, un kilooctet no té 1.000, sinó 1.024 octets ($2^{10}$ és $1.024$), és a dir 1.024$$8=8.192 bits.
es_es: De hecho, por fidelidad al sistema binario, un kilobyte no tiene 1.000, sino 1.024 bytes ($2^{10}$ és $1.024$), es decir 1.024$$8=8.192 bits.

source: Un programa és una seqüència (conjunt ordenat) d'instruccions que són seguides o executades pel maquinari, de tal manera que realitzen alguna tasca determinada. Normalment, els ordinadors estan organitzats al voltant d'un processador central (vegeu més endavant) que és capaç de comprendre i executar instruccions preses d'un conjunt determinat (el conjunt d'instruccions del processador).
es_es: Un programa es una secuencia (conjunto ordenado) de instrucciones que son seguidas o ejecutadas por el hardware, de tal manera que realizan alguna tarea determinada. Normalmente, los ordenadores están organizados alrededor de un procesador central (lo veremos más adelante) que es capaz de comprender y ejecutar instrucciones tomadas de un conjunto determinado (el conjunto de instrucciones del procesador).

source: Aquest és un servei similar a les llistes de distribució i, per tant, també serveix per a constituir grups de discussió o de notícies (newsgroups) sobre un tema; els missatges que s'hi envien hi queden guardats i qui vulga saber si hi ha novetats en un grup de discussió determinat només s'ha de connectar al servidor de notícies més pròxim, seleccionar el grup i llegir els missatges nous.
es_es: Este es un servicio similar a las listas de distribución y, por lo tanto, también sirve para constituir grupos de discusión o de noticias (newsgroups) sobre un tema; los mensajes que se envían quedan guardados y quienes quieran saber si hay novedades en un grupo de discusión determinado, sólo tienen que conectarse al servidor de noticias más próximo, seleccionar el grupo y leer los mensajes nuevos.

source: megaoctets o megabytes (MB), o milions d'octets.
es_es: megabytes (MB), o millones de megabytes.

source: Qüestions i exercicis
es_es: Ficheros y directorios

source: És a dir, totes les instal·lacions basades en ordinadors
es_es: Es decir, todas las instalaciones basadas en ordenadores
